tutorials/heatedCylinder/DirichletNeumann/constant/solid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/solid";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

#include "../../constant/include/CaseSetupValue";

mixture
{
    specie
    {
        molWeight   1; // Not used for solidThermo model
    }

    transport
    {
        kappa   $ks;
    }

    thermodynamics
    {
        Hf      0;
        Cp      $Cps;
    }

    equationOfState
    {
        rho     $rhos;
    }
}

// ************************************************************************* //
