tutorials/heatedCylinder/DirichletNeumann/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


#include "../../constant/include/CaseSetupValue";

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($U 0 0);

boundaryField
{
    Inlet 
    {
        type        characteristicVelocityInletOutletVelocity;
        U           ( $U 0.0 0.0 );
        p           $P;
        T           $Tf;
        value       $internalField;
    }

    "Outlet|Top|Bottom" 
    {
        type        characteristicPressureInletOutletVelocity;
        U           ( $U 0.0 0.0 );
        p           $P;
        T           $Tf;
        value       $internalField;
    }

    InterfaceFluid
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }

    FrontBack
    {
        type        empty;
    }
}

// ************************************************************************* //
