tutorials/heatedCylinder/DirichletNeumann/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


fluxScheme           AUSMPlusUp;

ddtSchemes
{
    default          bounded dualTime rPseudoDeltaT CrankNicolson 0.9;
    // default          bounded dualTime rPseudoDeltaT backward;
    // default          bounded dualTime rPseudoDeltaT Euler;
}

gradSchemes
{
    default          cellLimited faceLeastSquares linear 0.6;
    gradTVD         faceLeastSquares linear;
    grad(nuTilda)    cellLimited Gauss linear 0.9;
    grad(k)          cellLimited Gauss linear 0.9;
    grad(omega)      cellLimited Gauss linear 0.9;
}

divSchemes
{
    default          none;
    div(tauMC)       Gauss linear;
    div(phi,nuTilda) bounded Gauss upwind phi;
    div(phi,k)       bounded Gauss upwind phi;
    div(phi,omega)   bounded Gauss upwind phi;
}

laplacianSchemes
{
    default                     Gauss linear corrected;
    laplacian(muEff,U)          Gauss linear compact;
    laplacian(alphaEff,e)       Gauss linear compact;
}

interpolationSchemes
{
    default          linear;
    reconstruct(rho) wVanLeer gradTVD;
    reconstruct(U)   wVanLeer gradTVD;
    reconstruct(T)   wVanLeer gradTVD;
}

snGradSchemes
{
    default          corrected;
}

wallDist
{
//     method meshWave;
    method Poisson;
}



// ************************************************************************* //
