tutorials/heatedCylinder/DirichletNeumann/Allrun
#!/bin/sh

cd ${0%/*} || exit 1

. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun-mesh

./Allrun-sim

./Allrun-post

